%Ορισμός των dmin. Το 'dmin' ορίζεται κανονικά σύμφωνα με τις μετρήσεις τις
%εκφώνησης, όμως τα 'dminA1' και 'dminA2' χρειάστηκε να υποστούν ελάχιστες
%μικροαλλαγές στην τιμή που είχαν στο ερώτημα (α), ώστε η fzero να
%συγκλίσει σε ικανοποιητική τιμή
dmin = (((73 - 48.4) + (97.5 - 73) + (122.2 - 97.5)) / 3)*10^(-3);
dminA1 = 23.025*10^(-3);
dminA2 = 22.918*10^(-3);

%Ορισμός παραμέτρων σύμφωνα με την εκφώνηση
d1 = 1.5*10^(-3);
d2 = 1.517*10^(-3);
f = 9*10^9;
c = 2.998*10^8;
a = 22.86*10^(-3);
fc = c / (2*a);
n = 120*pi;
lg = 2*dmin;

%Εφαρμογή του θεωρητικού τύπου (φυλλάδιο 2ης άσκησης εργαστηρίου)
Z0 = n / sqrt(1-(fc/f)^2);

%Ορισμός των συναρτήσεων που θα δωθούν στην fzero. Πρόκειται για την σχέση
%της θεωρητικής ανάλυσης, εφαρμοσμένη για το υλικό 1 (fun1) και το υλικό
%2 (fun2)
fun1 = @(er1) (n*tan(d1*2*pi*sqrt(er1*f^2 - fc^2)/c)/sqrt(er1-(fc/f)^2) + Z0*tan(2*pi*dminA1/lg));
fun2 = @(er2) (n*tan(d2*2*pi*sqrt(er2*f^2 - fc^2)/c)/sqrt(er2-(fc/f)^2) + Z0*tan(2*pi*dminA2/lg));

%Κλήση της fzero, δίνοντάς της τις τιμες του ερωτήματος (α) ώστε να βρει
%τις πλησιέστερες σε αυτές λύσεις
er1 = fzero(fun1, 2.3748);
er2 = fzero(fun2, 4.1789);
disp(er1);
disp(er2);
