%Υπολογισμός των dmin χρησιμοποιώντας τις μετρήσεις της εκφώνησης
dmin = (((73 - 48.4) + (97.5 - 73) + (122.2 - 97.5)) / 3)*10^(-3);
dminA1 = (((71.5 - 48.4) + (96 - 73) + (120.7 - 97.5)) / 3)*10^(-3);
dminB1 = (((55.6 - 48.4) + (80.2 - 73) + (104.7 - 97.5)) / 3)*10^(-3);
dminA2 = (((71.3 - 48.4) + (95.8 - 73) + (120.5 - 97.5)) / 3)*10^(-3);
dminB2 = (((52.6 - 48.4) + (77 - 73) + (101.7 - 97.5)) / 3)*10^(-3);

%Ορισμός παραμέτρων σύμφωνα με την εκφώνηση
f = 9*10^9;
c = 2.998*10^8;
a = 22.86*10^(-3);
fc = c / (2*a);
n = 120*pi;
lg = 2*dmin;

%Εφαρμογή των θεωρητικών τύπων (φυλλάδιο 2ης άσκησης εργαστηρίου)
Z0 = n / sqrt(1-(fc/f)^2);
ZLSC1 = -1i*Z0*tan(2*pi*dminA1/lg);
ZLOC1 = -1i*Z0*tan(2*pi*dminB1/lg);
ZLSC2 = -1i*Z0*tan(2*pi*dminA2/lg);
ZLOC2 = -1i*Z0*tan(2*pi*dminB2/lg);
er1 = (fc/f)^2 + ((n^2) / (ZLSC1*ZLOC1));
er2 = (fc/f)^2 + ((n^2) / (ZLSC2*ZLOC2));
disp(er1);
disp(er2);
